spec/cassettes/StripeWrapper_Customer/with_a_valid_request/makes_a_new_plan_subscription_for_the_user.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=2016&card[cvc]=333
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_BPRW85SBx2sRT0pLjGFgWg0m
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.11.0","lang":"ruby","lang_version":"2.0.0 p451 (2014-02-24)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        Zech410 13.1.0 Darwin Kernel Version 13.1.0: Wed Apr  2 23:52:02 PDT 2014;
        root:xnu-2422.92.1~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 11 May 2014 00:30:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '571'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1040mQ2MJ4vAOzhlCHemVCfY",
          "livemode": false,
          "created": 1399768229,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_1040mQ2MJ4vAOzhlmZTHFVyp",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2016,
            "fingerprint": "1vn304fKHbHgJdVt",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Sun, 11 May 2014 00:30:29 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_1040mQ2MJ4vAOzhlCHemVCfY&plan=myflix_base&email=joeuser%40example.com
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_BPRW85SBx2sRT0pLjGFgWg0m
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.11.0","lang":"ruby","lang_version":"2.0.0 p451 (2014-02-24)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        Zech410 13.1.0 Darwin Kernel Version 13.1.0: Wed Apr  2 23:52:02 PDT 2014;
        root:xnu-2422.92.1~2/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '78'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 11 May 2014 00:30:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2185'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1399768229,
          "id": "cus_40mQN4pS1FaD28",
          "livemode": false,
          "description": null,
          "email": "joeuser@example.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_40mQN4pS1FaD28/subscriptions",
            "data": [
              {
                "id": "sub_40mQhtmmmzm79M",
                "plan": {
                  "interval": "month",
                  "name": "MyFlix Base Plan",
                  "created": 1399435879,
                  "amount": 999,
                  "currency": "usd",
                  "id": "myflix_base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": "MyFlix BasePlan"
                },
                "object": "subscription",
                "start": 1399768229,
                "status": "active",
                "customer": "cus_40mQN4pS1FaD28",
                "cancel_at_period_end": false,
                "current_period_start": 1399768229,
                "current_period_end": 1402446629,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_40mQN4pS1FaD28/cards",
            "data": [
              {
                "id": "card_1040mQ2MJ4vAOzhlmZTHFVyp",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 12,
                "exp_year": 2016,
                "fingerprint": "1vn304fKHbHgJdVt",
                "customer": "cus_40mQN4pS1FaD28",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_1040mQ2MJ4vAOzhlmZTHFVyp"
        }
    http_version: 
  recorded_at: Sun, 11 May 2014 00:30:29 GMT
recorded_with: VCR 2.9.0
